Tekla Open API Reference for Tekla Structures 2025
SurfacingAttributes Properties
The Surfacing.SurfacingAttributes type exposes the following members.
Properties
Name | Description
DrawHiddenLines
 True if hidden lines are drawn.
DrawOwnHiddenLines
 True if own hidden lines are enabled.
HiddenLines
 The line type of hidden lines.
Representation
 The representation type of the surfacing.
ShowPattern
 True if the pattern is shown.
VisibleLines
 The line type of visible lines.
Top
See Also
Reference
Surfacing.SurfacingAttributes Class
Tekla.Structures.Drawing Namespace